export const CITIES = [
    // مناطق وسط المملكة
    { name: 'الرياض', lat: 24.71, lon: 46.67 },
    { name: 'الدوادمي', lat: 24.50, lon: 44.39 },
    { name: 'عفيف', lat: 23.90, lon: 42.94 },
    { name: 'الوادي', lat: 20.46, lon: 44.79 },
    { name: 'الرين', lat: 23.51, lon: 45.31 },
    { name: 'الحصاة', lat: 22.61, lon: 44.73 },
    { name: 'الهضب', lat: 21.52, lon: 43.62 },
    { name: 'الأفلاج', lat: 22.28, lon: 46.74 },
    { name: 'ظلم', lat: 22.72, lon: 42.17 },

    // مناطق الغربية (الساحل والحجاز)
    { name: 'جدة', lat: 21.54, lon: 39.19 },
    { name: 'المدينة', lat: 24.52, lon: 39.56 },
    { name: 'الطائف', lat: 21.27, lon: 40.41 },
    { name: 'ينبع', lat: 24.08, lon: 38.06 },
    { name: 'العلا', lat: 26.60, lon: 37.92 },
    { name: 'الوجه', lat: 26.24, lon: 36.45 },

    // مناطق الشمالية
    { name: 'تبوك', lat: 28.38, lon: 36.58 },
    { name: 'حائل', lat: 27.52, lon: 41.69 },
    { name: 'عرعر', lat: 30.98, lon: 41.01 },
    { name: 'سكاكا', lat: 29.96, lon: 40.20 },
    { name: 'طريف', lat: 31.67, lon: 38.65 },
    { name: 'رفحاء', lat: 29.62, lon: 43.49 },
    { name: 'طبرجل', lat: 30.49, lon: 38.16 },
    { name: 'القريات', lat: 31.32, lon: 37.35 },
    { name: 'حقل', lat: 29.29, lon: 34.94 },
    { name: 'تيماء', lat: 27.62, lon: 38.53 },

    // القصيم
    { name: 'بريدة', lat: 26.32, lon: 43.97 },
    { name: 'عقلة الصقور', lat: 25.83, lon: 42.19 },

    // المنطقة الشرقية وجنوبها
    { name: 'الدمام', lat: 26.42, lon: 50.08 },
    { name: 'الأحساء', lat: 25.38, lon: 49.58 },
    { name: 'حفر الباطن', lat: 28.43, lon: 45.96 },
    { name: 'الخفجي', lat: 28.44, lon: 48.48 },

    // مناطق الجنوبية والربع الخالي
    { name: 'أبها', lat: 18.21, lon: 42.50 },
    { name: 'جازان', lat: 16.88, lon: 42.55 },
    { name: 'نجران', lat: 17.50, lon: 44.13 },
    { name: 'الباحة', lat: 20.01, lon: 41.46 },
    { name: 'بيشة', lat: 20.00, lon: 42.59 },
    { name: 'شرورة', lat: 17.48, lon: 47.11 },
    { name: 'الخرخير', lat: 18.86, lon: 51.12 },

    // دول الخليج، الإمارات، وعمان
    { name: 'الدوحة', lat: 25.2854, lon: 51.5310 },
    { name: 'أبوظبي', lat: 24.4539, lon: 54.3773 },
    { name: 'دبي', lat: 25.2048, lon: 55.2708 },
    { name: 'العين', lat: 24.1917, lon: 55.7606 },
    { name: 'خصب', lat: 26.1824, lon: 56.2425 },
    { name: 'صحم', lat: 24.1722, lon: 56.8886 },
    { name: 'مسقط', lat: 23.5859, lon: 58.4059 },
    { name: 'صور', lat: 22.5667, lon: 59.5289 },
    { name: 'رأس مدركة', lat: 18.9806, lon: 57.7944 },
    { name: 'صلالة', lat: 17.0151, lon: 54.0924 }
];
